# GetDiagramSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..GetDiagramSettings Method
AnalysisDisplayStyle Class See Also
---
Get diagram settings object from the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayDiagramSettings GetDiagramSettings()
```

Visual Basic
---
```text
Public Function GetDiagramSettings As AnalysisDisplayDiagramSettings
```

Visual C++
---
```text
public:
AnalysisDisplayDiagramSettings^ GetDiagramSettings()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | diagram settings were not created with the object. |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace